eir_psi_template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:ns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/PSI/5.0/">
   <soapenv:Header>
      <cai3:SessionId>$SESSION_ID</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Create>
         <cai3:MOType>PSISubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/PSI/5.0/</cai3:MOType>
         <cai3:MOId>
            <ns:subscriberId>$BASENUM!.*!@$DOMAIN</ns:subscriberId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <ns:createPSISubscription subscriberId="$BASENUM!.*!@$DOMAIN">
               <ns:subscriberId>$BASENUM!.*!@$DOMAIN</ns:subscriberId>
               <ns:subscriberBarringInd>FALSE</ns:subscriberBarringInd>
               <ns:chargingProfId>DefaultChargingProfile</ns:chargingProfId>
               <ns:pubData publicIdValue="sip:$BASENUM!.*!@$DOMAIN">
                  <ns:publicIdValue>sip:$BASENUM!.*!@$DOMAIN</ns:publicIdValue>
                  <ns:publicIdTelValue>tel:$BASENUM$TEL_REG_EXP</ns:publicIdTelValue>
                  <ns:implicitRegSet>0</ns:implicitRegSet>
                  <ns:isDefault>FALSE</ns:isDefault>
                  <ns:sessionBarringInd>FALSE</ns:sessionBarringInd>
                  <ns:configuredServiceProfiles configuredServiceProfileId="$PROFILE_ID">
                     <ns:configuredServiceProfileId>$PROFILE_ID</ns:configuredServiceProfileId>
                  </ns:configuredServiceProfiles>
                  <ns:maxSessions>5000</ns:maxSessions>
               </ns:pubData>
               <ns:privateUser privateUserId="$BASENUM!.*!@$DOMAIN"> 
                  <ns:privateUserId>$BASENUM!.*!@$DOMAIN</ns:privateUserId>
               </ns:privateUser>
            </ns:createPSISubscription>
         </cai3:MOAttributes>
      </cai3:Create>
   </soapenv:Body>
</soapenv:Envelope>